Repository: ahm282/QuickClock
Catalog: QuickClock-UI/src/locale/messages.*.xlf
Languages: ar_eg

# attendanceScannerStatusTitle
source: Current Status
ar_eg: الحالة الحالية

# statusClockedIn
source: Clocked In
ar_eg: حضور

# statusClockedOut
source: Clocked Out
ar_eg: انصراف

# sinceTimeLabel
source: Since <span class="font-medium text-foreground"> {{ clockService.clockStatus()!.lastClockTime }} </span>
ar_eg: منذ <span class="font-medium text-foreground"> {{ clockService.clockStatus()!.lastClockTime }} </span>

# scanAlignHint
source: Align QR code within the frame...
ar_eg: يرجى محاذاة رمز QR داخل الإطار...

# cameraErrorTitle
source: Camera Access Failed
ar_eg: فشل الوصول إلى الكاميرا

# tryAgainButton
source: Try Again
ar_eg: إعادة المحاولة

# readyToScanTitle
source: Ready to Scan
ar_eg: جاهز للمسح

# cameraUsageHint
source: Use your device camera to clock in or out
ar_eg: استخدم كاميرا جهازك لتسجيل الحضور أو الانصراف

# processingAttendanceMsg
source: Processing attendance...
ar_eg: جارٍ معالجة طلب تسجيل الحضور...

# stopScannerBtn
source: Stop Scanner
ar_eg: إيقاف الماسح

# startScannerBtn
source: Start Scanner
ar_eg: تشغيل الماسح

# lastScanLabel
source: Last scan: <span class="font-medium text-foreground"> {{ lastScanTime() }} </span>
ar_eg: آخر عملية مسح: <span class="font-medium text-foreground"> {{ lastScanTime() }} </span>

# recentActivityTitle
source: Today's Activity
ar_eg: نشاط اليوم

# noActivityMessage
source: No activity yet.
ar_eg: لا يوجد نشاط بعد.

# clockInLabel
source: Clock in
ar_eg: حضور

# breakStartLabel
source: Break start
ar_eg: بداية الاستراحة

# breakEndLabel
source: Break end
ar_eg: نهاية الاستراحة

# clockOutLabel
source: Clock out
ar_eg: انصراف

# greetingMorning
source: Good Morning
ar_eg: صباح الخير

# greetingAfternoon
source: Good Afternoon
ar_eg: نهارك سعيد

# greetingEvening
source: Good Evening
ar_eg: مساء الخير

# workHoursTitle
source: Work Hours
ar_eg: ساعات العمل

# retryWorkHoursButton
source: Retry
ar_eg: إعادة المحاولة

# noWorkHoursDataMessage
source: No data available.
ar_eg: لا توجد بيانات متاحة.

# refreshWorkHoursButton
source: Refresh
ar_eg: تحديث

# labelToday
source: Today
ar_eg: اليوم

# labelThisWeek
source: This week
ar_eg: هذا الأسبوع

# footerCopyright
source: © {{ getYear() }} QuickClock. All rights reserved.
ar_eg: © {{ getYear() }} QuickClock. جميع الحقوق محفوظة.

# logoutButtonLabel
source: <lucide-icon [img]="LogOut" [size]="18"></lucide-icon><span class="hidden md:block">Logout</span>
ar_eg: <lucide-icon [img]="LogOut" [size]="18"></lucide-icon><span class="hidden md:block">تسجيل الخروج</span>

# confirmLogoutTitle
source: Confirm Logout
ar_eg: تأكيد تسجيل الخروج

# confirmLogoutMessage
source: Are you sure you want to log out?
ar_eg: هل أنت متأكد من رغبتك في تسجيل الخروج؟

# cancelLogoutButton
source: Cancel
ar_eg: إلغاء

# confirmLogoutButton
source: Logout
ar_eg: تسجيل الخروج

# closeDialogAria
source: close
ar_eg: إغلاق
